In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("prdsales.csv")

In [9]:
df['rolling_max'] = df['sales'].rolling(5).max()

In [10]:
df

    prdid     prdname  sales  rolling_max
0       1   Product 1    187          NaN
1       2   Product 2    422          NaN
2       3   Product 3    315          NaN
3       4   Product 4     98          NaN
4       5   Product 5    540        540.0
5       6   Product 6    264        540.0
6       7   Product 7    391        540.0
7       8   Product 8    157        540.0
8       9   Product 9    605        605.0
9      10  Product 10    249        605.0
10     11  Product 11    331        605.0
11     12  Product 12    472        605.0
12     13  Product 13    128        605.0
13     14  Product 14    557        557.0
14     15  Product 15    302        557.0
15     16  Product 16    213        557.0
16     17  Product 17    498        557.0
17     18  Product 18    367        557.0
18     19  Product 19    145        498.0
19     20  Product 20    589        589.0
20     21  Product 21    276        589.0
21     22  Product 22    354        589.0
22     23  Product 23    421        589.0
23     24  Product 24    199        589.0
24     25  Product 25    610        610.0
25     26  Product 26    288        610.0
26     27  Product 27    336        610.0
27     28  Product 28    455        610.0
28     29  Product 29    167        610.0
29     30  Product 30    530        530.0
30     31  Product 31    248        530.0
31     32  Product 32    382        530.0
32     33  Product 33    419        530.0
33     34  Product 34    154        530.0
34     35  Product 35    570        570.0
35     36  Product 36    263        570.0

In [11]:
df['rolling_min'] = df['sales'].rolling(5).min()

In [12]:
df

    prdid     prdname  sales  rolling_max  rolling_min
0       1   Product 1    187          NaN          NaN
1       2   Product 2    422          NaN          NaN
2       3   Product 3    315          NaN          NaN
3       4   Product 4     98          NaN          NaN
4       5   Product 5    540        540.0         98.0
5       6   Product 6    264        540.0         98.0
6       7   Product 7    391        540.0         98.0
7       8   Product 8    157        540.0         98.0
8       9   Product 9    605        605.0        157.0
9      10  Product 10    249        605.0        157.0
10     11  Product 11    331        605.0        157.0
11     12  Product 12    472        605.0        157.0
12     13  Product 13    128        605.0        128.0
13     14  Product 14    557        557.0        128.0
14     15  Product 15    302        557.0        128.0
15     16  Product 16    213        557.0        128.0
16     17  Product 17    498        557.0        128.0
17     18  Product 18    367        557.0        213.0
18     19  Product 19    145        498.0        145.0
19     20  Product 20    589        589.0        145.0
20     21  Product 21    276        589.0        145.0
21     22  Product 22    354        589.0        145.0
22     23  Product 23    421        589.0        145.0
23     24  Product 24    199        589.0        199.0
24     25  Product 25    610        610.0        199.0
25     26  Product 26    288        610.0        199.0
26     27  Product 27    336        610.0        199.0
27     28  Product 28    455        610.0        199.0
28     29  Product 29    167        610.0        167.0
29     30  Product 30    530        530.0        167.0
30     31  Product 31    248        530.0        167.0
31     32  Product 32    382        530.0        167.0
32     33  Product 33    419        530.0        167.0
33     34  Product 34    154        530.0        154.0
34     35  Product 35    570        570.0        154.0
35     36  Product 36    263        570.0        154.0

In [13]:
df['rolling_median'] = df['sales'].rolling(5).median()

In [14]:
df

    prdid     prdname  sales  rolling_max  rolling_min  rolling_median
0       1   Product 1    187          NaN          NaN             NaN
1       2   Product 2    422          NaN          NaN             NaN
2       3   Product 3    315          NaN          NaN             NaN
3       4   Product 4     98          NaN          NaN             NaN
4       5   Product 5    540        540.0         98.0           315.0
5       6   Product 6    264        540.0         98.0           315.0
6       7   Product 7    391        540.0         98.0           315.0
7       8   Product 8    157        540.0         98.0           264.0
8       9   Product 9    605        605.0        157.0           391.0
9      10  Product 10    249        605.0        157.0           264.0
10     11  Product 11    331        605.0        157.0           331.0
11     12  Product 12    472        605.0        157.0           331.0
12     13  Product 13    128        605.0        128.0           331.0
13     14  Product 14    557        557.0        128.0           331.0
14     15  Product 15    302        557.0        128.0           331.0
15     16  Product 16    213        557.0        128.0           302.0
16     17  Product 17    498        557.0        128.0           302.0
17     18  Product 18    367        557.0        213.0           367.0
18     19  Product 19    145        498.0        145.0           302.0
19     20  Product 20    589        589.0        145.0           367.0
20     21  Product 21    276        589.0        145.0           367.0
21     22  Product 22    354        589.0        145.0           354.0
22     23  Product 23    421        589.0        145.0           354.0
23     24  Product 24    199        589.0        199.0           354.0
24     25  Product 25    610        610.0        199.0           354.0
25     26  Product 26    288        610.0        199.0           354.0
26     27  Product 27    336        610.0        199.0           336.0
27     28  Product 28    455        610.0        199.0           336.0
28     29  Product 29    167        610.0        167.0           336.0
29     30  Product 30    530        530.0        167.0           336.0
30     31  Product 31    248        530.0        167.0           336.0
31     32  Product 32    382        530.0        167.0           382.0
32     33  Product 33    419        530.0        167.0           382.0
33     34  Product 34    154        530.0        154.0           382.0
34     35  Product 35    570        570.0        154.0           382.0
35     36  Product 36    263        570.0        154.0           382.0

In [15]:
df = pd.read_csv("datewise.csv")

In [18]:
df['trans_date'] = pd.to_datetime(df['trans_date'])

In [24]:
df.groupby(["trans_date"]).agg("sales").max()

trans_date
2025-01-05    340
2025-01-06    510
2025-01-07    520
2025-01-08    498
2025-01-09    590
2025-01-10    602
2025-01-11    534
2025-01-12    589
2025-01-13    618
2025-01-14    540
2025-01-15    603
Name: sales, dtype: int64

In [25]:
df

    prdid     prdname  sales trans_date
0       1   Product 1    120 2025-01-05
1       2   Product 2    340 2025-01-05
2       3   Product 3    220 2025-01-05
3       4   Product 4    450 2025-01-06
4       5   Product 5    180 2025-01-06
5       6   Product 6    510 2025-01-06
6       7   Product 7    275 2025-01-06
7       8   Product 8    399 2025-01-07
8       9   Product 9    133 2025-01-07
9      10  Product 10    520 2025-01-07
10     11  Product 11    288 2025-01-07
11     12  Product 12    410 2025-01-08
12     13  Product 13    157 2025-01-08
13     14  Product 14    498 2025-01-08
14     15  Product 15    365 2025-01-08
15     16  Product 16    221 2025-01-09
16     17  Product 17    477 2025-01-09
17     18  Product 18    359 2025-01-09
18     19  Product 19    142 2025-01-09
19     20  Product 20    590 2025-01-09
20     21  Product 21    312 2025-01-10
21     22  Product 22    245 2025-01-10
22     23  Product 23    421 2025-01-10
23     24  Product 24    168 2025-01-10
24     25  Product 25    602 2025-01-10
25     26  Product 26    277 2025-01-11
26     27  Product 27    355 2025-01-11
27     28  Product 28    498 2025-01-11
28     29  Product 29    143 2025-01-11
29     30  Product 30    534 2025-01-11
30     31  Product 31    269 2025-01-12
31     32  Product 32    381 2025-01-12
32     33  Product 33    429 2025-01-12
33     34  Product 34    176 2025-01-12
34     35  Product 35    589 2025-01-12
35     36  Product 36    294 2025-01-13
36     37  Product 37    360 2025-01-13
37     38  Product 38    501 2025-01-13
38     39  Product 39    188 2025-01-13
39     40  Product 40    618 2025-01-13
40     41  Product 41    305 2025-01-14
41     42  Product 42    372 2025-01-14
42     43  Product 43    452 2025-01-14
43     44  Product 44    196 2025-01-14
44     45  Product 45    540 2025-01-14
45     46  Product 46    273 2025-01-15
46     47  Product 47    349 2025-01-15
47     48  Product 48    487 2025-01-15
48     49  Product 49    154 2025-01-15
49     50  Product 50    603 2025-01-15

In [ ]:
DF - Melt

In [ ]:
Prdname	UK 	US	AS
copper	454	534534	
Silver	345	54353	
Gold	5454	45435

In [28]:
df = pd.DataFrame({"prdname":['copper','silver','gold'],
                   "UK":[5545,6767,3434],
                   "US":[5757,34343,868676],
                   "test":[64534,324543,64455],
                   "temp":[75675,2324,7575]
                  })

In [29]:
df

  prdname    UK      US    test   temp
0  copper  5545    5757   64534  75675
1  silver  6767   34343  324543   2324
2    gold  3434  868676   64455   7575

In [31]:
final = pd.melt(df,id_vars=['prdname'],var_name='Region',value_name='Sales')

In [ ]:
Table --> 500 cols

melt -- 200 cols

In [34]:
final[final['prdname']=='copper']

  prdname Region  Sales
0  copper     UK   5545
3  copper     US   5757
6  copper   test  64534
9  copper   temp  75675

In [35]:
final

   prdname Region   Sales
0   copper     UK    5545
1   silver     UK    6767
2     gold     UK    3434
3   copper     US    5757
4   silver     US   34343
5     gold     US  868676
6   copper   test   64534
7   silver   test  324543
8     gold   test   64455
9   copper   temp   75675
10  silver   temp    2324
11    gold   temp    7575

In [36]:
df = pd.DataFrame({"studentname":['suresh','naresh','amit','sonali'],
                   "math":[46,34,75,34],
                   "science":[45,23,76,34],
                   "english":[65,23,75,34]
                  })

In [37]:
df

  studentname  math  science  english
0      suresh    46       45       65
1      naresh    34       23       23
2        amit    75       76       75
3      sonali    34       34       34

In [42]:
df1 = pd.melt(df,id_vars=["studentname"],var_name="Subjects",value_name="Marks")

In [43]:
df1

   studentname Subjects  Marks
0       suresh     math     46
1       naresh     math     34
2         amit     math     75
3       sonali     math     34
4       suresh  science     45
5       naresh  science     23
6         amit  science     76
7       sonali  science     34
8       suresh  english     65
9       naresh  english     23
10        amit  english     75
11      sonali  english     34

In [47]:
final = df1.pivot(index="studentname",columns="Subjects",values="Marks")

In [50]:
temp = final.reset_index()

In [56]:
temp.drop("Subjects",axis=1)

KeyError: "['Subjects'] not found in axis"

In [66]:
temp.reset_index(inplace=True)

In [73]:
temp.to_csv("temp1.csv",index=False)

In [74]:
df = pd.read_csv("temp1.csv")

In [76]:
df.drop("index",axis=1,inplace=True)

In [77]:
df

  studentname  english  math  science
0        amit       75    75       76
1      naresh       23    34       23
2      sonali       34    34       34
3      suresh       65    46       45